Examinator/src/InformationRegisters/РасписаниеОбученияСУО/РасписаниеОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РасписаниеОбученияСУО</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Баллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗавершеноВПроцентах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТекущиеБаллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Актуально</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПрохожденияОбъектовСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПроцессаОбучения</name>
    <type>
      <types>EnumRef.СтатусыПроцессаОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПроведения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПроведения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПроведения</name>
    <type>
      <types>EnumRef.СтатусыПроведенияОбъектовСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>CatalogRef.ВидыМероприятийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.УчебныеГруппыСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ШкалаОценки</name>
    <type>
      <types>CatalogRef.ШкалыОценокСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>МероприятиеСОднимЭлектроннымЗаданием</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрохождениеПрограммыОбучения</name>
    <type>
      <types>DocumentRef.ПрохождениеПрограммыОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>НаОсновеЭлектронногоРесурса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКонтроля</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветНаКалендаре</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыставляетсяОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>DefinedType.СценарийОбученияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/СтатусыПроцессаОбученияСУО/СтатусыПроцессаОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПроцессаОбученияСУО</name>
  <enumValues>
    <name>Запланировано</name>
  </enumValues>
  <enumValues>
    <name>Новое</name>
  </enumValues>
  <enumValues>
    <name>НеДопущен</name>
  </enumValues>
  <enumValues>
    <name>Активно</name>
  </enumValues>
  <enumValues>
    <name>Проверяется</name>
  </enumValues>
  <enumValues>
    <name>ВозвращеноНаДоработку</name>
  </enumValues>
  <enumValues>
    <name>Окончено</name>
  </enumValues>
  <enumValues>
    <name>ОконченоБезПроверки</name>
  </enumValues>
  <enumValues>
    <name>ОконченоАвтоматом</name>
  </enumValues>
  <enumValues>
    <name>НеОкончено</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/InformationRegisters/РасписаниеОбученияСУО/ManagerModule.bsl
Функция ВыбратьЭлементыРасписания(Пользователь, НачалоПериода=Неопределено, КонецПериода=Неопределено, Актуально=Истина) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос();

	Запрос.Параметры.Вставить("Пользователь", Пользователь);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	РасписаниеОбученияСУО.Регистратор КАК ПрохождениеОбучения,
	               |	РасписаниеОбученияСУО.ДатаНачалаПроведения КАК ДатаНачалаПроведения,
	               |	РасписаниеОбученияСУО.ДатаОкончанияПроведения КАК ДатаОкончанияПроведения,
	               |	РасписаниеОбученияСУО.Пользователь КАК Пользователь
	               |ИЗ
	               |	РегистрСведений.РасписаниеОбученияСУО КАК РасписаниеОбученияСУО
	               |ГДЕ
	               |	РасписаниеОбученияСУО.Пользователь В(&Пользователь)
	               |	И (РасписаниеОбученияСУО.Актуально = ИСТИНА
	               |			ИЛИ РасписаниеОбученияСУО.СтатусПроцессаОбучения = ЗНАЧЕНИЕ(Перечисление.СтатусыПроцессаОбученияСУО.НеДопущен))";
				   
	Если НачалоПериода <> Неопределено И КонецПериода <> Неопределено Тогда			   
				   
		Запрос.Текст = Запрос.Текст + "			   
					   |	И (РасписаниеОбученияСУО.ДатаНачалаПроведения МЕЖДУ &НачалоПериода И &КонецПериода
		               |			ИЛИ РасписаниеОбученияСУО.ДатаОкончанияПроведения МЕЖДУ &НачалоПериода И &КонецПериода
		               |			ИЛИ РасписаниеОбученияСУО.ДатаНачалаПроведения < &НачалоПериода
		               |				И РасписаниеОбученияСУО.ДатаОкончанияПроведения > &КонецПериода
		               |			ИЛИ РасписаниеОбученияСУО.ДатаНачалаПроведения = &ПустаяДата)";
					   
		Запрос.Параметры.Вставить("НачалоПериода", НачалоПериода);
		Запрос.Параметры.Вставить("КонецПериода", КонецПериода);
		Запрос.Параметры.Вставить("ПустаяДата", Дата("00010101"));
	
	КонецЕсли;
				   
	Результат = Запрос.Выполнить();

	Возврат Результат.Выбрать();
	
КонецФункции
